In [2]:
import numpy as np 
import pandas as pd

import category_encoders as ce

In [3]:
data = {'color': ['Red', 'Blue', 'Green']}
df = pd.DataFrame(data) 
df.head()

   color
0    Red
1   Blue
2  Green

In [4]:
encoder = ce.OneHotEncoder(use_cat_names=True)
df_encoded = encoder.fit_transform(df)
df_encoded.head()

   color_Red  color_Blue  color_Green
0          1           0            0
1          0           1            0
2          0           0            1

In [5]:
data = {'Pincode': ['753001', '753002', '753003', '753001', '753004', '753002', '753002', '753001', '753003']
        , 'O/P': [1, 1, 0, 0, 1, 0, 1, 0, 1]}
df = pd.DataFrame(data) 
df

  Pincode  O/P
0  753001    1
1  753002    1
2  753003    0
3  753001    0
4  753004    1
5  753002    0
6  753002    1
7  753001    0
8  753003    1

In [7]:
group_mean = df.groupby('Pincode')['O/P'].mean()
group_mean

Pincode
753001    0.333333
753002    0.666667
753003    0.500000
753004    1.000000
Name: O/P, dtype: float64

In [8]:
df['Mean'] = df['Pincode'].map(group_mean)
df.head()

  Pincode  O/P      Mean
0  753001    1  0.333333
1  753002    1  0.666667
2  753003    0  0.500000
3  753001    0  0.333333
4  753004    1  1.000000

In [9]:
data = {'column': ['Btech', 'Masters', 'High School', 'PHD']}
df = pd.DataFrame(data) 
df.head()

        column
0        Btech
1      Masters
2  High School
3          PHD

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
encoder = LabelEncoder()

df['column_encoded'] = encoder.fit_transform(df['column'])
df.head()

        column  column_encoded
0        Btech               0
1      Masters               2
2  High School               1
3          PHD               3